klausz65/illumos-gate/usr/src/man/man4d/cvc.4d
'\" te
.\"  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CVC 4D "Sep 15, 2000"
.SH NAME
cvc \- virtual console driver
.SH DESCRIPTION
.sp
.LP
The \fBcvc\fR virtual console driver is a STREAMS-based pseudo driver that
supports the network console. The \fBcvc\fR driver interfaces with
\fBconsole\fR(4D).
.sp
.LP
Logically, the  \fBcvc\fR driver sits below the  \fBconsole\fR driver. It
redirects console output to the \fBcvcredir\fR(4D) driver if a network console
connection is active. If a network console connection is not active, it
redirects console output to an internal hardware interface.
.sp
.LP
The \fBcvc\fR driver receives console input from  \fBcvcredir\fR and internal
hardware and passes it to the process associated with \fB/dev/console\fR.
.SH NOTES
.sp
.LP
The  \fBcvc\fR facility supersedes the SunOS \fBwscons\fR(4D) facility, which
should  \fInot\fR be used in conjunction with  \fBcvc\fR. The  \fBwscons\fR
driver is useful for systems with directly attached consoles (frame buffers and
keyboards), but is not useful with platforms using \fBcvc\fR, which have no
local keyboard or frame buffer.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	T{
Sun Enterprise 10000 servers,  Sun Fire 15000 servers
T}
.TE

.SH SEE ALSO
.sp
.LP
\fBcvcd\fR(8), \fBattributes\fR(5), \fBconsole\fR(4D), \fBcvcredir\fR(4D),
\fBwscons\fR(4D)
.sp
.LP
\fISun Enterprise 10000 SSP Reference Manual\fR
.sp
.LP
\fISun System Management Services (SMS) Reference Manual\fR
